#==========================================================================================
#============================Объявляем необходимые бибилотеки==============================
#==========================================================================================
import requests
import json
import sys
from bs4 import BeautifulSoup
import urllib
import re
import pathlib
from pathlib import Path
import openpyxl
import pandas
import nltk
import yargy
import natasha
import numpy
#import sklearn
import scrapy
import pickle

#==========================================================================================
#======================Закрываем пути на файлы внутри репозитория==========================
#==========================================================================================

#Получаем строку, содержащую путь к домашней директории:
dir_path = pathlib.Path.home()

#объявляем все необходимые пути к файлам
path_main_py=Path(dir_path,'main.py')




